continents-request.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/"
                  xmlns:gs="http://spring.io/generated">
    <soapenv:Header/>
    <soapenv:Body>
        <gs:getContinentRequest>
            <gs:name>Spain</gs:name>
        </gs:getContinentRequest>
    </soapenv:Body>
</soapenv:Envelope>